Catalogs/ИзделияЗаказчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИзделияЗаказчика</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПомещенияСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерПоТЗ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВДоговоре</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзделияЭлемент</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИзделиеЭлемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзделияЭлемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Помещения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ДанныеИзделияЗаказчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеИзделияЗаказчика</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеСАртикулом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИзделиеЗаказчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияЗаказчика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИтогоПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИтогоПроекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИзделияЗаказчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияЗаказчика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ПриложенияКДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПриложенияКДоговорам</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутреннийЗапасВНеделях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отказ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокМонтажаВНеделях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОкончанияМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОкончанияПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОкончанияПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПроектированияВНеделях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПроизводстваВНеделях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьАвтор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзделияЗаказчика</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИзделиеЗаказчика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзделияЗаказчика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УслугиПриложенияДоговора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УслугаПриложенияДоговора</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УслугиПриложенияДоговора</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИзделияЗаказчика/Forms/ФормаВыбора/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Проект") Тогда 
		Проект = Параметры.Проект;
		Элементы.Проект.ТолькоПросмотр = Истина;
		Если ЭтаФорма.Параметры.Свойство("ТолькоНеИспользованые") Тогда
			Если ЭтаФорма.Параметры.ТолькоНеИспользованые Тогда
				Список.ТекстЗапроса = "ВЫБРАТЬ
				                      |	спрИзделияЗаказчика.Ссылка КАК Ссылка,
				                      |	спрИзделияЗаказчика.Комментарий КАК Комментарий,
				                      |	спрИзделияЗаказчика.Наименование КАК Наименование,
				                      |	ДанныеИзделияЗаказчика.Актуальность КАК Актуальность,
				                      |	ДанныеИзделияЗаказчика.НомерПоПорядку КАК НомерПоПорядку,
				                      |	спрИзделияЗаказчика.Код КАК Код
				                      |ИЗ
				                      |	Справочник.ИзделияЗаказчика КАК спрИзделияЗаказчика
				                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПриложенияКДоговорам.ИзделияЗаказчика КАК тчДоговораСделкиЭлементыСделки
				                      |		ПО (тчДоговораСделкиЭлементыСделки.ИзделиеЗаказчика = спрИзделияЗаказчика.Ссылка)
				                      |			И (НЕ тчДоговораСделкиЭлементыСделки.Ссылка = &СсылкаДоговор)
				                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеИзделияЗаказчика КАК ДанныеИзделияЗаказчика
				                      |		ПО (ДанныеИзделияЗаказчика.ИзделиеЗаказчика = спрИзделияЗаказчика.Ссылка)
				                      |ГДЕ
				                      |	спрИзделияЗаказчика.Проект = &Проект
				                      |	И тчДоговораСделкиЭлементыСделки.Ссылка ЕСТЬ NULL
				                      |	И НЕ спрИзделияЗаказчика.ЭтоГруппа
				                      |	И НЕ спрИзделияЗаказчика.Ссылка В (&ТекущиеЭлементыСделк)";
				
									  
				Список.Параметры.УстановитьЗначениеПараметра("ТекущиеЭлементыСделк",ЭтаФорма.Параметры.ТекущиеИзделияЗаказчика);
				Список.Параметры.УстановитьЗначениеПараметра("СсылкаДоговор",ЭтаФорма.Параметры.СсылкаДоговор);
			КонецЕсли;
			Список.Параметры.УстановитьЗначениеПараметра("Проект",ЭтаФорма.Параметры.Проект);
		КонецЕсли;
		
		Элементы.Список.Отображение = ОтображениеТаблицы.Список; 
		Если Параметры.Свойство("Отказ") Тогда
			Если Параметры.Отказ Тогда
				Список.ТекстЗапроса = "ВЫБРАТЬ
				                      |	спрИзделияЗаказчика.Ссылка КАК Ссылка,
				                      |	спрИзделияЗаказчика.Комментарий КАК Комментарий,
				                      |	спрИзделияЗаказчика.Наименование КАК Наименование,
				                      |	ДанныеИзделияЗаказчика.Актуальность КАК Актуальность,
				                      |	ДанныеИзделияЗаказчика.НомерПоПорядку КАК НомерПоПорядку,
				                      |	спрИзделияЗаказчика.Код КАК Код
				                      |ИЗ
				                      |	Справочник.ИзделияЗаказчика КАК спрИзделияЗаказчика
				                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПриложенияКДоговорам.ИзделияЗаказчика КАК тчДоговораСделкиЭлементыСделки
				                      |		ПО (тчДоговораСделкиЭлементыСделки.ИзделиеЗаказчика = спрИзделияЗаказчика.Ссылка)
				                      |			И (НЕ тчДоговораСделкиЭлементыСделки.Ссылка = &СсылкаДоговор)
				                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеИзделияЗаказчика КАК ДанныеИзделияЗаказчика
				                      |		ПО (ДанныеИзделияЗаказчика.ИзделиеЗаказчика = спрИзделияЗаказчика.Ссылка)
				                      |ГДЕ
				                      |	спрИзделияЗаказчика.Ссылка В(&ТекущиеЭлементыСделк)";
				
				
				Список.Параметры.УстановитьЗначениеПараметра("ТекущиеЭлементыСделк"
				,РегистрыСведений.ИтогоПроекта.ОстаткиПоДоговору(Параметры.Проект,Параметры.НомерПоПорядку).ВыгрузитьКолонку("ИзделияЗаказчика"));
				
				Элементы.Список.Отображение = ОтображениеТаблицы.Список; 
			КонецЕсли;
			
		ИначеЕсли Параметры.Свойство("НеПоказыватьИзделияЗаказчика") Тогда
			Список.ТекстЗапроса = "ВЫБРАТЬ
			                      |	спрИзделияЗаказчика.Ссылка КАК Ссылка,
			                      |	спрИзделияЗаказчика.Комментарий КАК Комментарий,
			                      |	спрИзделияЗаказчика.Наименование КАК Наименование,
			                      |	ДанныеИзделияЗаказчика.Актуальность КАК Актуальность,
			                      |	ДанныеИзделияЗаказчика.НомерПоПорядку КАК НомерПоПорядку,
			                      |	спрИзделияЗаказчика.Код КАК Код
			                      |ИЗ                                                                                        
			                      |	Справочник.ИзделияЗаказчика КАК спрИзделияЗаказчика
			                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеИзделияЗаказчика КАК ДанныеИзделияЗаказчика
			                      |		ПО (ДанныеИзделияЗаказчика.ИзделиеЗаказчика = спрИзделияЗаказчика.Ссылка)
			                      |ГДЕ
			                      |	спрИзделияЗаказчика.Проект = &Проект
			                      |	И НЕ спрИзделияЗаказчика.Ссылка В (&НеПоказыватьИзделияЗаказчика)";
			
			
			Список.Параметры.УстановитьЗначениеПараметра("Проект", 							Параметры.Проект); 
			Список.Параметры.УстановитьЗначениеПараметра("НеПоказыватьИзделияЗаказчика", 	Параметры.НеПоказыватьИзделияЗаказчика); 
		КонецЕсли;
		
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Проект",ЭтаФорма.Проект);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СделкаПриИзмененииНаСервере()
	Список.Параметры.УстановитьЗначениеПараметра("Проект",ЭтаФорма.Проект);
КонецПроцедуры

&НаКлиенте
Процедура СделкаПриИзменении(Элемент)
	СделкаПриИзмененииНаСервере();
КонецПроцедуры
